blogapi/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "views", "votes", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"